import React, { Component } from 'react'
import './register.less'

import logo from '../../images/logo.png'

class RegisterAgreement extends Component {
    
    go_login () {
        window.location.hash="/login"
    }
    go_homepage () {
        window.location.hash="/"
    }
    render() {
        
        return (
            <div className="Register">
                <header className="common-header">
                    <img onClick={this.go_homepage.bind(this)} className="logo1" src={logo} alt=""/>
                    <div className="go-login">已有账户， <span onClick={this.go_login.bind(this)}>登录</span></div>
                </header>
                <div className="agreement">
                    <div className="agreementTitle">银盾云网站服务条款</div>
                    <div className="agreementContent"> 前言<br/><br/>
                    欢迎访问银盾云网站并使用我们提供的产品和服务。 <br/><br/>
                    在完成注册程序或以任何方式使用银盾云网站服务前，请您务必仔细阅读并透彻理解本银盾云网站服务条款(以下或简称“服务条款”)，在确认充分理解后选择接受或不接受本服务条款；一旦您完成“同意条款并注册”或开始以其他方式使用银盾云服务，即表明您已阅读并同意受本服务条款的约束。如您不同意本服务条款或其中任何条款约定，您应不再进行下一步或停止注册程序。 <br/><br/>
                    银盾云再次提示您审慎阅读、充分理解各条款内容，特别是限制或免除责任的相应条款，限制或免除责任条款将以加粗或其他醒目形式提示您注意。 <br/><br/>
                    如果您未满18周岁，请在法定监护人的陪同下阅读本服务条款。 <br/><br/>
                    一、 签约主体以及协议范围 <br/>
                    1.1. 银盾云网站服务条款是您与杭州微云开呗科技有限公司（“银盾云”或者“我们”）就使用银盾云网站服务（包含为您提供网站页面信息浏览、账户注册服务等）而订立的有效合约。 <br/>
                    银盾云网站包含域名为www.yinduncloud.com的网站以及银盾云客户端,如APP。 <br/>
                    1.2. 如您使用或购买银盾云网站上某一具体云服务，您可仍需确认具体服务对应的服务条款；请您审慎阅读、充分理解各条款内容，选择接受或不接受该服务条款。 <br/><br/>
                    二、账户的注册、使用与安全 <br/>
                    2.1. 注册的资格 <br/>
                    2.1.1. 您确认，在您完成注册程序或以其他银盾云允许的方式实际使用本服务时，您应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织（以下或简称为“您”）。 <br/>
                    2.1.2. 若您是未成年人或限制民事行为能力人，则您不具备前述主体资格，您及您的监护人应承担因您的不当注册行为而导致的一切后果。 <br/>
                    2.1.3. 您还需确保您不是任何国家、国际组织或者地域实施的贸易限制、制裁或其他法律、规则限制的对象，否则您可能无法正常注册及使用银盾云服务。 <br/>
                    2.2. 账户注册 2.2.1.当您按照注册页面提示填写信息、阅读并同意本服务条款且完成全部注册程序后，您可获得银盾云账户并成为银盾云的用户。 <br/>
                    2.2.2. 您在注册时候设置或确认的账户名（“账户名称”）及您设置的密码，将在注册成功后成为您的账户（账户名称及密码合称“账户”）。 <br/>
                    2.2.3. 您设置的账户名不得违反国家法律法规、银盾云的管理规范或容易引起您与银盾云身份的混淆，否则您的账户可能不能注册成功或银盾云有权经通知您后予以注销。 <br/>
                    2.2.4. 您应当按照法律法规要求或按相应页面的提示，准确提供并及时更新您的账户信息，以使之真实、及时、完整和准确。如您提供的资料错误、不实、过时或不完整的，银盾云可以向您发出询问及/或要求改正的通知，您应按照银盾云的要求配合提供或者更新相关资料。因您填写的信息、资料不真实、不及时、不完整或不准确的，您应承担您不能使用银盾云账户（不能注册成功、或账户被冻结、注销）或您在使用过程中的后果和损失。 <br/>
                    2.2.5. 银盾云可能会就某些产品或服务的开通，要求您提供更多的身份资料和信息，做进一步的身份认证或资格验证，您的账户只有在通过这些认证和验证之后，方可获得使用相关产品或服务的资格。 <br/>
                    2.2.6. 通常情况下，您的银盾云账户是您在银盾云网站进行一切活动的唯一身份标识，除非另有约定，每一个银盾云账户都可以在本网站独立开展活动。但在下列情形下，银盾云有权根据自己的判断，对同一及/或关联法律主体拥有的多个银盾云账户进行统一处理，如根据不同银盾云账户在注册、登录、使用中的关联信息，银盾云判断其实际为同一用户。关联信息举例：同一证件、同一手机号、同一支付账号、同一设备、同一地址等。 <br/>
                    2.3. 账户的使用和安全 2.3.1. 您有权使用您设定的账户登录银盾云网站，进而使用银盾云提供的其他服务。 <br/>
                    2.3.2. 银盾云可能会以邮件、站内信、短信或电话等方式通知您服务进展情况以及提示您进行下一步的操作。在服务过程中您应当及时登录到银盾云账户查看和进行交易操作。 <br/>
                    2.3.3. 一个银盾云账户仅能对应唯一的法律主体。除非有法律明文规定、司法裁定或者经银盾云同意的情况下，您不得以任何方式转让、赠与或让他人继承您的银盾云账户。 <br/>
                    2.3.4. 您的账户和密码由您自行设置并由您保管，您须对您的银盾云账户和密码保密。您需确保您在每个上网时段结束时，以正确步骤离开网站。 <br/>
                    2.3.5. 如发现他人未经授权使用您的银盾云账户和密码，您应立即通知银盾云；银盾云将协助您冻结账户、更改密码或进行其他安全设置；您理解银盾云对您的请求采取行动需要合理时间，银盾云对在采取行动前已经产生的以及由您引发的后果（包括但不限于您的任何损失）不承担任何责任。 <br/>
                    2.3.6. 银盾云亦会在网站服务端采取合理的技术措施保障账户的安全。 <br/><br/>
                    三、账户的冻结、注销及申诉 <br/>
                    3.1. 账户的冻结 您的银盾云账户（全部或部分权限或功能）在如下情况可能被冻结（如银盾云帐户被限制资金转出功能等），银盾云将通过邮件、站内信、短信或电话等方式通知您： <br/>
                    3.1.1. 基于银盾云网站或服务运行和交易安全的需要，如您发生或可能发生破坏或试图破坏银盾云或银盾云关联公司公平交易环境或正常交易秩序的，或任何使用含有银盾云或银盾云关联公司名称、品牌且对他人有误导嫌疑或任何使用某种中英文(全称或简称)、数字、域名等意图表示或映射与银盾云或其关联公司具有某种关联的； <br/>
                    3.1.2. 违反本服务条款、银盾云网站的相关规则、规范（如交易规则、管理规范）、服务说明以及其他服务协议/条款的； <br/>
                    3.1.3. 违反国家法律、法规、政策、法律文书的规定的； <br/>
                    3.1.4. 您遭到他人投诉， 且对方已经提供了相关证据的，而您未按照我们的要求提供相反证据的； <br/>
                    3.1.5. 银盾云根据合理分析判断您的账户操作、收益、兑换等存在异常的； <br/>
                    3.1.6. 国家有权机关要求进行的冻结的； <br/>
                    3.1.7. 银盾云合理判断，您发生与如上行为性质相同或产生如上类似风险的其他情况的。 <br/>
                    3.2. 账户的注销 <br/>
                    3.2.1. 如果出现如上第3.1条情形且情形严重的，或基于国家有权机关的要求，您的银盾云账户（全部或部分权限或功能）将被注销，银盾云将通过邮件、站内信、短信或电话等方式通知您。 <br/>
                    3.2.2. 您理解并同意，如您连续12个月未通过账户登录过银盾云网站，且您的账户下不存在任何未到期的服务，银盾云有权注销您的账户，您将不能再登录银盾云网站。 <br/>
                    3.3. 申诉 发生前述账户冻结或注销情况下，您应及时予以关注并可以按照程序进行申诉等后续操作： <br/>
                    3.3.1. 您通过申诉程序，向银盾云申请解除上述冻结或注销的，为了您的账户安全，您应配合如实提供身份证明及相关资料，以及银盾云要求的其他信息或文件，以便银盾云进行核实。您应充分理解您的申诉并不必然被允许，银盾云有权决定是否同意您的申诉请求。 <br/>
                    3.3.2. 您理解并同意，如果您拒绝如实提供身份证明及相关资料，或未能通过银盾云审核，银盾云有权长期冻结该等账户且长期限制账户部分或全部功能。 <br/><br/>
                    四、网站服务及规范 <br/>
                    4.1．您有权享受银盾云通过本网站提供的互联网技术服务和信息服务。您同时还应根据本服务条款以及您在购买具体服务时确认的相关条款和条件，履行及时付款、服务管理等责任。 <br/>
                    4.2. 您使用银盾云的服务，您应保证： <br/>
                    4.2.1. 您使用银盾云服务时将遵从国家、地方法律法规、行业惯例和社会公共道德，不会利用银盾云提供的服务进行存储、发布、传播如下信息和内容： <br/>
                    （ⅰ）违反国家法律法规政策的任何内容（信息）； <br/>
                    （ⅱ）违反国家规定的政治宣传和/或新闻信息； <br/>
                    （ⅲ）涉及国家秘密和/或安全的信息； <br/>
                    （ⅳ）封建迷信和/或淫秽、色情、下流的信息或教唆犯罪的信息； <br/>
                    （ⅴ）博彩有奖、赌博游戏；违反国家民族和宗教政策的信息； <br/>
                    （ⅵ）妨碍互联网运行安全的信息； <br/>
                    （ⅶ）侵害他人合法权益的信息和/或其他有损于社会秩序、社会治安、公共道德的信息或内容； <br/>
                    （ⅷ）您同时承诺不得为他人发布上述不符合国家规定和/或本服务条款约定的信息内容提供任何便利，包括但不限于设置URL、BANNER链接等； <br/>
                    4.2.2. 不应出现任何破坏或试图破坏网络安全等的行为，包括不会利用技术或其他手段破坏或扰乱本网站及银盾云其他客户的网站； <br/>
                    4.2.3. 您使用银盾云网站的服务应符合本服务条款； 如您违反上述保证，银盾云除有权根据相关服务条款采取删除信息、中止服务、终止服务的措施，并有权冻结或注销您账户部分或全部功能。 <br/><br/>
                    五、隐私及个人信息的保护 <br/>
                    您的信任对银盾云非常重要，银盾云深知用户信息安全的重要性，银盾云将按照法律法规要求，采取安全保护措施，保护您的用户信息安全可控。具体详见《法律声明及隐私权政策》。 <br/><br/>
                    六、知识产权 <br/>
                    6.1. 我们尊重知识产权，除非获得了您的同意，银盾云不会擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表您拥有知识产权的成果。 <br/>
                    6.2. 任何组织或个人认为银盾云网站的网页内容，如转载文章、云市场服务商发布的商品信息等可能侵犯其合法权益的，可向银盾云（www.yinduncloud.com）提出书面权利通知，银盾云将在收到知识产权权利人合格通知后依法尽快处理。 <br/>
                    6.3. 除非另行说明，银盾云网站Logo、“银盾云”、“yinduncloud”等文字、图形及其组合，以及银盾云网站的其他标识、徽记、银盾云服务的名称、技术文档等的知识产权为银盾云及其关联公司所有。 <br/>
                    6.4. 您应尊重银盾云和第三方的知识产权和其他合法权利/权益，并保证在发生侵犯前述权益的违法事件时，保护银盾云及其雇员、股东、合作伙伴等免于因该等事件受到影响或损失，银盾云保留在您侵犯银盾云及/或其他第三方的合法权利/权益时终止向您提供服务并不退还任何款项的权利。 其他具体信息详见《法律声明及隐私权政策》的法律声明部分。 <br/><br/>
                    七、保密 <br/>
                    银盾云承诺对您注册账户时或使用银盾云服务时提交或知悉的信息采取保密措施，不向第三方披露您的信息，除非： <br/>
                    7.1. 依据本服务条款或者您与银盾云之间其他服务协议、合同、在线条款等规定可以提供的； <br/>
                    7.2. 依据法律法规的规定或行政、司法等职权部门要求应当提供的； <br/>
                    7.3. 在不违反本服务条款约定责任的前提下，该保密信息已经公开或能从公开领域获得。 <br/><br/>
                    八、出口管制 <br/>
                    双方承诺遵守本协议所适用的联合国、中国、美国以及其他国家出口管制法律法规。您承诺不会将银盾云提供的产品或服务用于适用的出口管制法律法规禁止的用途。非经相关主管机关许可，您及您授权使用银盾云产品或服务的其他个人或实体不会通过银盾云产品或服务向适用的出口管制法律法规禁止的实体或个人提供受管控的技术、软件或服务。 <br/><br/>
                    九、信息安全事件 <br/>
                    银盾云将依据国家法律法规的要求、遵照相关安全事件处理标准管理信息安全事件。当发生涉及您相关资产的信息安全事件时，我们会依法及时将事件相关的情况通过邮件、信函、电话、推送通知等方式告知，您也可通过工单、客服电话、大客户经理电话等方式主动联系我们。 <br/><br/>
                    十、责任范围和责任限制 <br/>
                    10.1. 您了解并同意，您应承担因您使用本服务、违反本服务条款或在您的账户下采取的任何行动而导致的任何第三方索赔。如果由此引起银盾云及其关联公司、员工、客户和合作伙伴被第三方索赔的，您应负责处理，并赔偿银盾云及其关联公司由此遭受的全部损失和责任。 <br/>
                    10.2. 在适用法律许可的范围内，银盾云不对与本服务条款有关或由本服务条款引起的任何间接的、惩罚性的、特殊的、派生的损失承担赔偿责任。 <br/>
                    10.3. 银盾云在此提示，您在使用银盾云服务期间应当遵守中华人民共和国的法律，不得危害网络安全，不得利用银盾云的服务从事侵犯他人名誉、隐私、知识产权和其他合法权益的活动。银盾云不对您使用银盾云服务的违法或违约行为承担任何责任。 <br/>
                    10.4. 银盾云用户在银盾云网站的论坛、社区以及云市场上自行上传、提供、发布相关信息，包括但不限于用户名称、公司名称、 联系人及联络信息，相关图片、资讯等，均由用户自行提供，银盾云的用户须对其提供的前述信息依法承担全部责任。 <br/>
                    10.5. 如果您通过使用银盾云网站或获取来自第三方的任何产品或服务，例如，银盾云云市场上的服务商依托云市场向您提供服务，服务商将对其提供的服务向您负责，银盾云对此第三方服务不承担任何责任。 <br/>
                    10.6. 在某些情况下，为了帮助您更便捷的使用银盾云的服务，银盾云可能会展示银盾云的参考代码或软件（如属于第三方开源软件，您则应遵守第三方开源软件的相关使用要求），基于相应展示页面的使用说明，该等软件可能允许您予以下载、进行二次开发等相关操作，您应理解并承诺，该等代码的知识产权属于银盾云，您在使用时应明确表明权利人，同时，银盾云不对您能否使用以及使用该等代码、软件的工作和后果负责。 <br/><br/>
                    十一、不可抗力和意外事件 <br/>
                    银盾云的网站可能因为下列不可抗力或意外事件无法正常运行的，银盾云不承担损害赔偿责任： <br/>
                    11.1. 因自然灾害、罢工、暴乱、战争、政府行为、司法行政命令等不可抗力因素； <br/>
                    11.2. 因电力供应故障、通讯网络故障等公共服务因素； <br/>
                    11.3. 经提前公告或通知的，银盾云在短时间内的系统维护。 <br/><br/>
                    十二、 法律适用与管辖 <br/>
                    本服务条款之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。因本服务条款产生之争议应提交至浙江省杭州市上城区人民法院解决。 <br/><br/>
                    十三、通知送达 <br/>
                    13.1. 您理解并同意，银盾云可通过网页公告、电子邮件、站内信、短信、电话、系统消息以及即时通信等以上一种或多种通知方式向您发送通知，且银盾云可以信赖您所提供的联系信息是完整、准确且当前有效的；上述通知在发送成功后视为已送达。 <br/>
                    13.2．除非本服务条款另有约定或银盾云与您另行签订的协议明确规定了通知方式，您发送给银盾云的通知，应当通过银盾云对外正式公布的通信地址、传真号码、电子邮件地址等联系信息进行送达。 <br/><br/>
                    十四、条款的更新和终止 <br/>
                    14.1. 银盾云有权对本服务条款及相应的服务规则内容进行变更，并将网页公告、电子邮件、站内信、短信等方式予以公告或通知；若您在本服务条款内容变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的内容，也将遵循修改后的条款内容。 <br/>
                    14.2. 在您的账户注销或经双方协商一致终止网站服务的，本服务条款终止。 <br/><br/>
                    十五、其他 <br/>
                    15.1. 本服务条款由本服务条款的内容、网站相关页面上展现的规则、规范，服务说明（含操作文档）和您点击确认的其他条款/条件组成，银盾云和您均受其约束，且其中的相关名词可相互引用、解释。 <br/>
                    15.2. 本服务条款的章节标题仅为行文方便而设，不具有法律或合同效力。 <br/>
                    15.3. 本服务条款任一条款被视为废止、无效或不可执行，该条款应视为可分的且不影响本服务条款及其他条款的有效性及可执行性。 <br/>
                    15.4. 银盾云有权在银盾云官网（www.yinduncloud.com）上发布公告、发站内通知或邮件通知等方式将本服务的权利义务全部或者部分转移给银盾云的关联公司。 <br/>
                    15.5. 除另有约定外，出于服务专业性考虑，银盾云亦可能委托关联公司或其他法律主体向您提供银盾云网站上一项或多项具体服务，同时您可能会与该等公司订立相关条款或条件，请您审慎阅读、充分理解条款和条件内容，选择接受或不接受该条款和条件。 <br/>
                    15.6. 本服务条款项下之保密条款、知识产权条款、法律适用与管辖条款以及性质上理应存续的其他条款（如对注册信息的真实性保证等），不因本条款的终止而失效。 </div>
                </div>
            </div>
        );
    }
}

export default RegisterAgreement;
